# 列表的切片是浅拷贝，仅仅两个列表的id不同，但内部的可变元素仍然是对原来的元素的引用

a = [[1, 2], [3, 4, 5]]
b = a[:]
b[0][1] = 0
print(a, b)                                  # [[1, 0], [3, 4, 5]] [[1, 0], [3, 4, 5]]
print(id(a) == id(b), id(a[0]) == id(b[0]))  # False True

c = [[1, 2], [3, 4, 5]]
d = c[:]
d[0] = []
print(c, d)                                  # [[1, 2], [3, 4, 5]] [[], [3, 4, 5]]
print(id(c) == id(d), id(c[0]) == id(d[0]))  # False False

e = [[1, 2], [3, 4, 5]]
f = e[:]
f[0].clear()
print(e, f)                                  # [[], [3, 4,  5]] [[], [3, 4, 5]]
print(id(e) == id(f), id(e[0]) == id(f[0]))  # False True

